Revit 2027 API
RebarShapeConstraintChordLength Constructor
 Create a constraint to drive chord length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraintChordLength(
	ElementId paramId
)
Public Sub New (
	paramId As ElementId
)
public:
RebarShapeConstraintChordLength(
	ElementId^ paramId
)
new :
        paramId : ElementId -> RebarShapeConstraintChordLength
Parameters
paramId ElementId
 The Id of a Rebar Shape parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeConstraintChordLength Class
Autodesk.Revit.DB.Structure Namespace